src/test/resources/performancetest/testplan_final_load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="EN-01 Immediate Feedback Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>

    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Users">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <longProp name="ThreadGroup.duration">300</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>

        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>

      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set - Mixed Correct and Incorrect Submissions" enabled="true">
          <stringProp name="filename">/test/src/test/resources/performancetest/performance_test_data.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">questionId,answer,userId,expectedCorrect,expectedAllowReattempt,expectedMessageContains</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">app</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </ConfigTestElement>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time - 5 to 15 Seconds" enabled="true">
          <stringProp name="ConstantTimer.delay">5000</stringProp>
          <stringProp name="RandomTimer.range">10000</stringProp>
        </UniformRandomTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Submit Answer - Mixed Workload" enabled="true">
          <stringProp name="HTTPSampler.domain">app</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/answer</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>

          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  &quot;questionId&quot;: &quot;${questionId}&quot;,
  &quot;answer&quot;: &quot;${answer}&quot;,
  &quot;userId&quot;: &quot;${userId}&quot;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>

        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">8</intProp>
            <stringProp name="Assertion.custom_message">Valid POST /api/answer requests must return HTTP 200.</stringProp>
          </ResponseAssertion>
          <hashTree/>

          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Assert Response Time Under 1000ms" enabled="true">
            <stringProp name="DurationAssertion.duration">1000</stringProp>
          </DurationAssertion>
          <hashTree/>

          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Required JSON Fields" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="955164778">correct</stringProp>
              <stringProp name="954925063">message</stringProp>
              <stringProp name="-1105867239">explanation</stringProp>
              <stringProp name="1197722116">suggestion</stringProp>
              <stringProp name="-502131727">allowReattempt</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
            <stringProp name="Assertion.custom_message">Response body must contain correct, message, explanation, suggestion, and allowReattempt.</stringProp>
          </ResponseAssertion>
          <hashTree/>

          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert Functional Correctness From CSV Data" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">functional-correctness-assertion</stringProp>
            <stringProp name="script">import groovy.json.JsonSlurper

def responseText = prev.getResponseDataAsString()
def json = new JsonSlurper().parseText(responseText)

def expectedCorrect = vars.get(&quot;expectedCorrect&quot;).toBoolean()
def expectedAllowReattempt = vars.get(&quot;expectedAllowReattempt&quot;).toBoolean()
def expectedMessageContains = vars.get(&quot;expectedMessageContains&quot;)

def failures = []

if (json.correct != expectedCorrect) {
    failures &lt;&lt; &quot;Expected correct=${expectedCorrect}, but got correct=${json.correct}. Response: ${responseText}&quot;
}

if (json.allowReattempt != expectedAllowReattempt) {
    failures &lt;&lt; &quot;Expected allowReattempt=${expectedAllowReattempt}, but got allowReattempt=${json.allowReattempt}. Response: ${responseText}&quot;
}

if (json.message == null || !json.message.toString().contains(expectedMessageContains)) {
    failures &lt;&lt; &quot;Expected message to contain '${expectedMessageContains}', but got '${json.message}'. Response: ${responseText}&quot;
}

if (json.suggestion == null || json.suggestion.toString().trim().isEmpty()) {
    failures &lt;&lt; &quot;Expected a non-empty suggestion field. Response: ${responseText}&quot;
}

if (json.explanation == null) {
    failures &lt;&lt; &quot;Expected explanation field to exist. Response: ${responseText}&quot;
}

if (!failures.isEmpty()) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(failures.join(&quot; | &quot;))
}</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/test/src/test/resources/performancetest/load_test.csv</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>